---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsPipeOuterDiameter
source: html/1ba1576b-4dc2-8f43-4077-cd2c7432b88b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsPipeOuterDiameter Property

"Outside Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsPipeOuterDiameter { get; }
```